Show / Hide Table of Contents
Class SteelSetupIND
Steel setup IND class
Inheritance
System.Object
SteelSetup
SteelSetupIND
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel
Assembly: IdeaRS.OpenModel.dll
Syntax
public class SteelSetupIND : SteelSetup
Properties
Improve this Doc   View Source
GammaM0
Partial safety factor for resistance governed by yielding
Declaration
public double GammaM0 { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
GammaM1
Partial safety factor for resistance governed by ultimate stress
Declaration
public double GammaM1 { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
GammaMb
Partial safety factor for bolts - bearing type
Declaration
public double GammaMb { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
GammaMf
Partial safety factor for bolts - friction type
Declaration
public double GammaMf { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
GammaMw
Partial safety factor for welds
Declaration
public double GammaMw { get; set; }
Property Value
 Type |  Description
 System.Double
Methods
Improve this Doc   View Source
FrictionCoefficientPboltDefault()
Friction Coefficient Pbolt Default
Declaration
public override double FrictionCoefficientPboltDefault()
Returns
 Type |  Description
 System.Double
Overrides
SteelSetup.FrictionCoefficientPboltDefault()
 Improve this Doc
 View Source